# Задача-2:
# Напишите скрипт отображающий папки текущей директории
import os
def directoria():
    print(os.listdir())
if __name__ == '__main__':
    directoria()